#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-staging/runs/run-ifpaFtke1Coa7h6A

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
aws_cloudwatch_log_group.external_composer: Refreshing state... [id=staging_external]
aws_sqs_queue.image_builder_pozorbot: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/933752197999/image-builder-pozorbot-staging]
aws_s3_bucket.imagebuilder_s3: Refreshing state... [id=imagebuilder.service.staging]
aws_iam_user.packer: Refreshing state... [id=packer_staging]
aws_iam_user.imagebuilder_worker: Refreshing state... [id=imagebuilder_worker_staging]
aws_cloudwatch_log_group.pozorbot_cloudwatch_logs: Refreshing state... [id=/aws/lambda/pozorbot_staging]
aws_cloudwatch_log_group.internal_composer: Refreshing state... [id=staging_internal]
aws_iam_role.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2_staging]
aws_iam_role.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_role.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3_staging]
aws_iam_policy.packer: Refreshing state... [id=arn:aws:iam::933752197999:policy/packer_staging]
aws_iam_role.spot_fleet_tagging_role: Refreshing state... [id=imagebuilder_spot_fleet_role_staging]
aws_cloudwatch_log_stream.external_worker_syslog: Refreshing state... [id=worker_syslog]
aws_cloudwatch_log_stream.external_composer_syslog: Refreshing state... [id=composer_syslog]
aws_iam_role.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_role.pozorbot_lambda_role: Refreshing state... [id=pozorbot_lambda_role_staging]
aws_iam_role.vmimport: Refreshing state... [id=vmimport_staging]
aws_iam_policy.spotfleet_iam_spot_policy: Refreshing state... [id=arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy_staging]
aws_cloudwatch_log_stream.internal_worker_syslog: Refreshing state... [id=worker_syslog]
aws_cloudwatch_log_stream.internal_composer_syslog: Refreshing state... [id=composer_syslog]
aws_iam_instance_profile.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_instance_profile.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_role_policy_attachment.spotfleet_iam_role_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656385800000003]
aws_iam_instance_profile.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_user_policy_attachment.imagebuilder_vmimport: Refreshing state... [id=imagebuilder_worker_staging-20210121192045197600000002]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-08d5fdb7cd26e5c94]
aws_security_group.internal_allow_egress: Refreshing state... [id=sg-0eb65fd8f2c17dba5]
aws_security_group.internal_allow_trusted: Refreshing state... [id=sg-084607083aaa39727]
aws_iam_policy.pozorbot_client_sqs: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_client_sqs_staging]
aws_iam_policy.pozorbot_read_secrets: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_read_secrets_staging]
aws_iam_user_policy_attachment.packer: Refreshing state... [id=packer_staging-20201204204656365500000001]
aws_iam_policy.pozorbot_lambda_sqs: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_lambda_sqs_staging]
aws_iam_policy.pozorbot_lambda_cloudwatch: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_lambda_cloudwatch_staging]
aws_iam_policy.external_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_worker_read_keys_staging]
aws_lambda_function.pozorbot_lambda: Refreshing state... [id=pozorbot_staging]
aws_iam_policy.internal_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_composer_read_keys_staging]
aws_iam_policy.internal_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_worker_read_keys_staging]
aws_iam_role_policy_attachment.spotfleet_iam_spot_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656553800000004]
aws_iam_policy.external_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_composer_read_keys_staging]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport_staging-20210121192045244900000003]
aws_iam_instance_profile.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport_staging-20210121192044923500000001]
aws_vpc_endpoint.internal_vpc_secretsmanager: Refreshing state... [id=vpce-0d13154306549b1cd]
aws_iam_role_policy_attachment.external_pozorbot_composer: Refreshing state... [id=external_worker_staging-20210127152215239700000003]
aws_iam_role_policy_attachment.pozorbot_lambda_secrets: Refreshing state... [id=pozorbot_lambda_role_staging-20210127150546817300000001]
aws_iam_role_policy_attachment.pozorbot_lambda_sqs: Refreshing state... [id=pozorbot_lambda_role_staging-20210127130509124000000001]
aws_iam_role_policy_attachment.external_pozorbot_worker: Refreshing state... [id=external_composer_staging-20210127152215237300000002]
aws_iam_role_policy_attachment.internal_pozorbot_composer: Refreshing state... [id=internal_worker_staging-20210127152215241500000004]
aws_iam_role_policy_attachment.internal_pozorbot_worker: Refreshing state... [id=internal_composer_staging-20210127152215216300000001]
aws_vpc_endpoint.internal_vpc_cloudwatch_logs: Refreshing state... [id=vpce-01e031ba5033ab0c5]
aws_security_group.external_workers: Refreshing state... [id=sg-0f578bf2872026f5d]
aws_vpc_endpoint.external_vpc_s3: Refreshing state... [id=vpce-0249da6b762fae5de]
aws_iam_policy.internal_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_cloudwatch_logging_staging]
aws_iam_policy.external_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_cloudwatch_logging_staging]
aws_iam_role_policy_attachment.pozorbot_lambda_cloudwatch: Refreshing state... [id=pozorbot_lambda_role_staging-20210127132820714600000001]
aws_iam_role_policy_attachment.external_worker_read_keys: Refreshing state... [id=external_worker_staging-20210113202541913700000002]
aws_iam_role_policy_attachment.internal_composer_read_keys: Refreshing state... [id=internal_composer_staging-20201204204656559200000005]
aws_iam_policy.imagebuilder_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder_workers_s3_staging]
aws_iam_role_policy_attachment.external_composer_read_keys: Refreshing state... [id=external_composer_staging-20210113202541907800000001]
aws_lambda_event_source_mapping.pozorbot_sqs: Refreshing state... [id=7ae0421e-5c59-4b9e-971a-aab448662f51]
aws_ebs_volume.composer_internal: Refreshing state... [id=vol-058d1cec56397f102]
aws_iam_role_policy_attachment.internal_worker_read_keys: Refreshing state... [id=internal_worker_staging-20201204204656366800000002]
aws_iam_role_policy_attachment.external_cloudwatch_worker: Refreshing state... [id=external_composer_staging-20210113203644029600000002]
aws_network_interface.composer_internal: Refreshing state... [id=eni-07088640399f60f49]
aws_iam_role_policy_attachment.external_cloudwatch_composer: Refreshing state... [id=external_worker_staging-20210113203644009900000001]
aws_iam_role_policy_attachment.internal_cloudwatch_composer: Refreshing state... [id=internal_worker_staging-2020120420465704850000000b]
aws_iam_role_policy_attachment.internal_cloudwatch_worker: Refreshing state... [id=internal_composer_staging-2020120420465704340000000a]
aws_security_group.external_composer: Refreshing state... [id=sg-0be4cfbfac3cc0022]
aws_iam_user_policy_attachment.imagebuilder_s3: Refreshing state... [id=imagebuilder_worker_staging-2020120420465705150000000c]
aws_ebs_volume.composer_external: Refreshing state... [id=vol-0daeecfc25da04a05]
aws_network_interface.composer_external: Refreshing state... [id=eni-02f250427cdd85dc7]
aws_eip.lb: Refreshing state... [id=eipalloc-0f8be222c563c4767]
aws_instance.composer_external: Refreshing state... [id=i-035379ae62f35ce17]
aws_volume_attachment.composer_external: Refreshing state... [id=vai-1911393042]
aws_launch_template.worker_external_x86: Refreshing state... [id=lt-0195b4ef20679c780]
aws_spot_fleet_request.workers_external_x86: Refreshing state... [id=sfr-a007db26-c324-4b9d-8caf-cf37b637254d]
aws_instance.composer_internal: Refreshing state... [id=i-0f2a613e34ee8496a]
aws_volume_attachment.composer_internal: Refreshing state... [id=vai-2376940936]
aws_launch_template.worker_internal_x86: Refreshing state... [id=lt-0a23e96f3feb1649c]
aws_spot_fleet_request.workers_internal_x86: Refreshing state... [id=sfr-2f29a128-797e-4240-8e9c-cd8e4b24b5e6]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.schutzbot_webhook_sqs will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "schutzbot_webhook_sqs"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:ReceiveMessage",
              + "sqs:SendMessage",
            ]
          + resources = [
              + (known after apply),
            ]
          + sid       = "PozorbotSQS"
        }
    }

  # aws_iam_policy.schutzbot_webhook_sqs will be created
  + resource "aws_iam_policy" "schutzbot_webhook_sqs" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "schutzbot_webhook_sqs_staging"
      + path   = "/"
      + policy = (known after apply)
    }

  # aws_iam_user.schutzbot_webhook_sqs will be created
  + resource "aws_iam_user" "schutzbot_webhook_sqs" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "schutzbot_webhook_staging"
      + path          = "/"
      + tags          = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "Schutzbot Webhook - staging"
          + "ServiceOwner" = "Image Builder"
        }
      + unique_id     = (known after apply)
    }

  # aws_iam_user_policy_attachment.schutzbot_webhook_sqs will be created
  + resource "aws_iam_user_policy_attachment" "schutzbot_webhook_sqs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "schutzbot_webhook_staging"
    }

  # aws_sqs_queue.schutzbot_webhook_sqs will be created
  + resource "aws_sqs_queue" "schutzbot_webhook_sqs" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "schutzbot_webhook_sqs-staging"
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + tags                              = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "Schutzbot Webhook SQS - staging"
          + "ServiceOwner" = "Image Builder"
        }
      + visibility_timeout_seconds        = 30
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>

*Pusher: @major, Action: `pull_request`*